tests/Fixtures/200_payInvoiceList_response.json

[{"id":"a6761c8b-468f-40ad-a522-cc5e41c39757","t":1612460165497,"duration":86399,"amount":2.5,"currency":"USD","orderId":"order123","payCurrencies":["BTC","ETH","UST-ETH","LNX"],"webhook":"https://example.com/api/v3/order/order123","redirectUrl":"https://example.com/checkout/order123","status":"COMPLETED","customerInfo":{"nationality":"DE","residCountry":"GB","residCity":"London","residZipCode":"WC2H 7NA","residStreet":"5-6 Leicester Square","residBuildingNo":"23 A","fullName":"John Doe","email":"john@example.com","tosAccepted":true},"invoices":[{"amount":0.00006262,"payCurrency":"BTC","poolCurrency":"BTC","address":"bc1qyegkyyk656vrqp0pzyg8p4yy9xlqfhxlrg0jtf"},{"amount":0.00201242,"payCurrency":"ETH","poolCurrency":"ETH","address":"0xeFd9434A2B1076D5C84D242b6f4AAb47270EcEAC"},{"amount":2.51094528,"payCurrency":"UST","poolCurrency":"ETH","address":"0xeFd9434A2B1076D5C84D242b6f4AAb47270EcEAC"},{"amount":0.00006259,"payCurrency":"BTC","poolCurrency":"LNX","address":"4e4c40ea9116cd555829f0826b4c95cb","ext":{"hash":"455fd202d9d6e984f649f365e41cd8f9a899e0e6e59d4500406fa244bc84d997","payment_request":"lnbcrt10u1p0lgwaqpp5g40ayqke6m5cfajf7dj7g8xclx5fnc8xukw52qzqd73yf0yymxtsdp5xc6nqcmpv9jnvde3xajkgde5vfsnsvf5xccr2wtxxsuxzwfj8psscqzpgxqzjcsp539mychlv9rdye6nnc2uvwpx83yd07stqvkdrtg0luv73pkxy86rs9qy9qsquen6che9kcfh80x24lrk4tmltl9728f52de5hzs6gfxn52n78ts5rxrvesznugvatty6cv7sgdmrvh3kyj2m5x88t8s0ruqyxldhwsqqptsvz8","node_pub":"02ef93b8bbec0cd3dd8c78c22827a2bb0cf9cb054b432d1da86c9431cf57e0e715"}}],"payment":{"txid":"144f46a6-174c-4e05-8a6e-40b3fbb755ad","amount":0.00006262,"currency":"BTC","method":"BITCOIN","status":"COMPLETED","confirmations":1,"created_at":"2021-02-0522:21:15","updated_at":"2021-02-0522:21:15","depositId":1357996}}]
